In [ ]:
import pandas as pd

data = {
    "Nombre": ["Alice", "Bob", "Charlie", "David", "David"],
    "Edad": [25, 30, 35, 40, 40],
    "Ciudad": ["New York", "Los Angeles", "Chicago", "Chicago", "Chicago"],
    "Salario": [70000, 80000, 90000, 100000, 100000]
}

df = pd.DataFrame(data)
#print(df)

# obtener la primera fila del DataFrame
df.head()

# obtener las dimensiones del DataFrame (filas x columnas)
df.shape

# obtener el numero de columnas
df.columns

# obtener los tipos
df.dtypes

df = df.drop_duplicates()

# obtener un resumen del df
df.info()

df.head()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nombre   4 non-null      object
 1   Edad     4 non-null      int64
 2   Ciudad   4 non-null      object
 3   Salario  4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 160.0+ bytes

    Nombre  Edad       Ciudad  Salario
0    Alice    25     New York    70000
1      Bob    30  Los Angeles    80000
2  Charlie    35      Chicago    90000
3    David    40      Chicago   100000

In [33]:

# trabajar con el dataframe

df["Ciudad"]

df[["Ciudad", "Salario"]]

# filtra por condiciones
df[ df["Salario"] >= 100000 ]

df[ df["Ciudad"] == "Chicago" ]


df[ (df["Salario"] >= 80000) &  (df["Ciudad"] == "Los Angeles")  ]

  Nombre  Edad       Ciudad  Salario
1    Bob    30  Los Angeles    80000

In [40]:
# crear columnas

df["Salario Mensual"] = df["Salario"] / 12

df.info()
df["Salario Mensual"]

df["Salario Mensual"].mean()

df["Salario Mensual"] = df["Salario Mensual"].astype(int)
df["Salario Mensual"]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Nombre           4 non-null      object
 1   Edad             4 non-null      int64
 2   Ciudad           4 non-null      object
 3   Salario          4 non-null      int64
 4   Salario Mensual  4 non-null      float64
dtypes: float64(1), int64(2), object(2)
memory usage: 288.0+ bytes

0    5833
1    6666
2    7500
3    8333
Name: Salario Mensual, dtype: int64

In [ ]:
# guardar o exportar mi dataframe
df.to_csv("new_dataframe.csv")

In [91]:
# Cargar o importar dataframe  
df_salary = pd.read_csv("data/ds_salaries.csv")

#df_salary.head()
#df_salary.info()

#df_salary["salary_in_usd"]

df_salary = df_salary.drop_duplicates()
df_salary.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2584 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           2584 non-null   int64
 1   experience_level    2584 non-null   object
 2   employment_type     2584 non-null   object
 3   job_title           2584 non-null   object
 4   salary              2584 non-null   int64
 5   salary_currency     2584 non-null   object
 6   salary_in_usd       2584 non-null   int64
 7   employee_residence  2584 non-null   object
 8   remote_ratio        2584 non-null   int64
 9   company_location    2584 non-null   object
 10  company_size        2584 non-null   object
dtypes: int64(4), object(7)
memory usage: 242.2+ KB

In [ ]:
df_salary["job_title"]

df_salary["job_title_clean"] =  df_salary["job_title"].str.lower().str.replace("Lead", "").str.strip().str.replace("principal", "")

df_salary["job_title_clean"]

df_salary.info()

df_salary["job_title_clean"]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
 11  job_title_clean     3755 non-null   object
dtypes: int64(4), object(8)
memory usage: 352.2+ KB

0              data scientist
1                 ml engineer
2                 ml engineer
3              data scientist
4              data scientist
                ...
3750           data scientist
3751           data scientist
3752           data scientist
3753    business data analyst
3754     data science manager
Name: job_title_clean, Length: 3755, dtype: object